In [2]:
import pandas as pd

### load csv file

In [3]:

data = pd.read_csv('person.csv')
data

   Age  Salary  Experience_Years Education_Level  Purchased_Product
0   22   25000                 0        Bachelor                  0
1   25   30000                 1        Bachelor                  0
2   47   50000                 5          Master                  1
3   35   42000                 3        Bachelor                  1
4   52   60000                10             PhD                  1
5   46   58000                 8          Master                  1
6   29   32000                 2        Bachelor                  0
7   41   52000                 6          Master                  1
8   39   48000                 4        Bachelor                  1
9   28   34000                 1        Bachelor                  0

## index col parameter

In [5]:
pd.read_csv('person.csv' , index_col = 'Education_Level')

                 Age  Salary  Experience_Years  Purchased_Product
Education_Level
Bachelor          22   25000                 0                  0
Bachelor          25   30000                 1                  0
Master            47   50000                 5                  1
Bachelor          35   42000                 3                  1
PhD               52   60000                10                  1
Master            46   58000                 8                  1
Bachelor          29   32000                 2                  0
Master            41   52000                 6                  1
Bachelor          39   48000                 4                  1
Bachelor          28   34000                 1                  0

### header parameter

In [11]:
pd.read_csv('person.csv')

   Age  Salary  Experience_Years Education_Level  Purchased_Product
0   22   25000                 0        Bachelor                  0
1   25   30000                 1        Bachelor                  0
2   47   50000                 5          Master                  1
3   35   42000                 3        Bachelor                  1
4   52   60000                10             PhD                  1
5   46   58000                 8          Master                  1
6   29   32000                 2        Bachelor                  0
7   41   52000                 6          Master                  1
8   39   48000                 4        Bachelor                  1
9   28   34000                 1        Bachelor                  0

### use_cols parameter

In [12]:
pd.read_csv('person.csv' , usecols=['Age' , 'Salary'] )

   Age  Salary
0   22   25000
1   25   30000
2   47   50000
3   35   42000
4   52   60000
5   46   58000
6   29   32000
7   41   52000
8   39   48000
9   28   34000

### skip rows

In [25]:
pd.read_csv('person.csv' , nrows=15 )
pd.read_csv('person.csv' , skiprows=5 )

   52  60000  10       PhD  1
0  46  58000   8    Master  1
1  29  32000   2  Bachelor  0
2  41  52000   6    Master  1
3  39  48000   4  Bachelor  1
4  28  34000   1  Bachelor  0

### skip bad lines

In [ ]:
# skip lines that accure error
pd.read_csv('person.csv' , sep=';' , error_bad_lines=False)

### dtypes parameter

In [ ]:
#change the datatype of a column

# pd.read_csv('person.csv').info()
pd.read_csv('person.csv' , dtype={'Age':float} ).info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Age                10 non-null     float64
 1   Salary             10 non-null     int64
 2   Experience_Years   10 non-null     int64
 3   Education_Level    10 non-null     object
 4   Purchased_Product  10 non-null     int64
dtypes: float64(1), int64(3), object(1)
memory usage: 532.0+ bytes

### Handling Dates

In [ ]:
# pass data in string -> convert to data formate

pd.read_csv(' file_name' , parse_dates=['DOB'] )

### converters

In [ ]:
# Mumbai indians - MI

def convert_team_name(name):
    if name == 'MI':
        return 'Mumbai Indians'
    elif name == 'RCB':
        return 'Royal Challengers Bangalore'
    else:
        return name
    
pd.read_csv('matches.csv' , converters={'team1':convert_team_name , 'team2':convert_team_name} )

### na_values parameter

In [ ]:
# values = NaN

pd.read_csv('person.csv' , na_values=['Not Available' , 'n.a.' , 'NA' , '--'] )

### load huge dataset in chunks

In [36]:
df = pd.read_csv('person.csv' , chunksize=5)
for chunk in df:
    print(chunk)

   Age  Salary  Experience_Years Education_Level  Purchased_Product
0   22   25000                 0        Bachelor                  0
1   25   30000                 1        Bachelor                  0
2   47   50000                 5          Master                  1
3   35   42000                 3        Bachelor                  1
4   52   60000                10             PhD                  1
   Age  Salary  Experience_Years Education_Level  Purchased_Product
5   46   58000                 8          Master                  1
6   29   32000                 2        Bachelor                  0
7   41   52000                 6          Master                  1
8   39   48000                 4        Bachelor                  1
9   28   34000                 1        Bachelor                  0